Documents/ОценкаПассажира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ОценкаПассажира</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РейтингПассажиров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поездка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поездка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пассажир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РейтингПассажиров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>РейтингПассажиров</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пассажир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ОценкаПассажира/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Пассажир = ЭтотОбъект.Пассажир;	
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ОценкаПассажира.Оценка КАК Оценка
    |ИЗ
    |   Документ.ОценкаПассажира КАК ОценкаПассажира
    |ГДЕ
    |   ОценкаПассажира.Пассажир = &Пассажир";
    Запрос.УстановитьПараметр("Пассажир", Пассажир);
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
	
    СуммаОценок = 0;
    КоличествоОценок = 0;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Оценка.Наименование <> "" Тогда
		   СуммаОценок = СуммаОценок + Число(Выборка.Оценка.Наименование);
		   КоличествоОценок = КоличествоОценок + 1;    
	   	КонецЕсли;        
    КонецЦикла;
    Если КоличествоОценок > 0 Тогда
        Рейтинг = СуммаОценок / КоличествоОценок;
    Иначе
        Рейтинг = 0;
    КонецЕсли;
	
	Движения.РейтингПассажиров.Записывать = Истина;
	Движение = Движения.РейтингПассажиров.Добавить();
	Движение.Пассажир = Пассажир;
    Движение.Рейтинг = Рейтинг;
	Движение.Период = ТекущаяДата();
КонецПроцедуры
